---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WindowTypeId
source: html/f5a3a829-1b51-f22d-852e-9734fb017afc.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WindowTypeId Property

"Type Mark"

## Syntax (C#)
```csharp
public static ForgeTypeId WindowTypeId { get; }
```